'''
Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные
в модуль функции под псевдонимами. (3-7 строк
импорта).
'''

from lesson_001 import task_005 as sol

print(sol(20, 3))
